app/Controllers/Home.php

SELECT *
FROM `events`
---
    public function index()
    {
        $data = [];
        // dd(session()->get('PseudoNom'));
        $eventModel = new EventModel();
        $data['events'] = $eventModel->findAll();