app/Controllers/ReclamationController.php

SELECT *
FROM `reclamation`
WHERE `Status` = 'Pending'
---
    public function listreclamation()
    {
        $data = [];
        $Reclam = new ReclamationModel();
        $session = session()->get('PseudoNom');
        if ($session == "admin") {
            $data['data'] = $Reclam->where('Status','Pending')->findAll();